package org.opentutorials.javatutorials._930_array;

public class _1_DefineDemo {

	public static void main(String[] args) {
		
		// 배열(array)
		// 배열이란? : 연관된 정보를 그룹화
		// 지금까지는 하나의 변수에 하나의 데이터만 넣을 수 있었다.
		// 연관된 여러 개의 데이터를 하나의 변수에 담아서 이를 쉽게 관리할 수 있게 도와주는 것이 배열(array)이다.
		// 배열 또한 데이터 타입이다.(int, boolean)과 같은 데이터 타입이다.
		// 지금까지는 변수를 하나의 데이터를 저장하기 위한 것으로 사용했지만 변수 안에 배열을 담으면 그 변수에 여러 개의 데이터를 담을 수 있다는 것이 배열의 핵심이다.
		
		
		// 02.배열의 정의
		// 배열 생성(배열 정의하는 방법)
		// String[] classGroup = {"최진혁","최유빈","한이람","이고잉"};  // -> String[] classGroup이라고 돼 있으면, classGroup이라는 변수에는 문자열 데이터로 구성된 배열이 담긴다는 의미이다.(비밀)
		// 배열도 다른 데이터 타입과 마찬가지로 변수에 담는다. classGroup이 변수명이 되고, 이 변수를 담아낼 수 있는 데이터 타입(String[])을 지정해줘야 한다.
		// 배열을 선언할 경우 배열에 담고 싶은 데이터를 중괄호[]로 감싼다.
		// 중괄호[]안에 들어갈 데이터들은 쉼표(,)를 사용하여 구분하여 준다.
		
	}

}
